---
kind: enumMember
id: F:Autodesk.Revit.DB.ImageTypeStatus.Generated
enum: Autodesk.Revit.DB.ImageTypeStatus
source: html/b84b2403-3c15-b917-ec36-7cca79c50c81.htm
---
# Autodesk.Revit.DB.ImageTypeStatus.Generated

The internally created image is available.